# Boolean Indexing

 - Series / DataFrame 객체에서 빠르게 원하는 원소를 추출하기 위해 사용
 
 - Series / DataFrame 객체의 원소에 연산 후 True/False인 결과

In [62]:
# 모듈 로딩
import pandas as pd

# DF객체 생성
df=pd.DataFrame({'name':['Park','KIm','Lee'],
                'age':[10,21,16],
                 'gender':['F','F','M']})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [63]:
# DF객체 데이터 확인
df

   name  age gender
0  Park   10      F
1   KIm   21      F
2   Lee   16      M

In [64]:
# age 컬럼 + 비교연산 => 15세이상
ageCol=df['age']
ageCol

0    10
1    21
2    16
Name: age, dtype: int64

In [65]:
result=ageCol>=15     # ageCol 원소마다 >=15 비교 결과
result

0    False
1     True
2     True
Name: age, dtype: bool

In [66]:
# age가 15세 이상인 데이터만 추출

ageover15=df[result]
ageover15

  name  age gender
1  KIm   21      F
2  Lee   16      M

In [67]:
df[df['age']>=15]

  name  age gender
1  KIm   21      F
2  Lee   16      M

# 과제-1----------------0701

In [102]:
# 성별이 남자인 데이터만 추출하기

df[df['gender']=='M']

  name  age gender
2  Lee   16      M

In [92]:
# 15세 이상 남자만 추출하기

df[(df.gender == 'M') & (df.age >= 15)]

  name  age gender
2  Lee   16      M

In [110]:
result1=df[df['gender']=='F']
result1

   name  age gender
0  Park   10      F
1   KIm   21      F

In [111]:
result2=result1[df['age']>=15]
result2

C:\Users\User\AppData\Local\Temp\ipykernel_12244\1672406132.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  result2=result1[df['age']>=15]

  name  age gender
1  KIm   21      F